[
    {
        "id": 1,
        "name": "ISTJ",
        "show": "اللوجستي",
        "description": "أنت شخص مسؤول، صادق، تحليلي، متحفظ، واقعي، منهجي. مجتهد وجدير بالثقة مع حُكم عملي سليم. تميل إلى الجدية والواقعية والتحفظ. تقدّر النظام والتنظيم وتولي اهتمامًا كبيرًا للتفاصيل. تفضل التخطيط المسبق وتضع أهمية كبيرة على التقاليد والقوانين.",
        "powerP": [
            "• تهتم بالتفاصيل ومنظم: بارع في إدارة المشاريع والجداول والعمليات المنطقية. ",
            "• موثوق ودقيق: يمكن الاعتماد عليك في الوفاء بالالتزامات. ",
            "• محافظ على التقاليد: غالبًا ما تكون الدعامة الأساسية في الفرق أو العائلات من خلال الحفاظ على الأساليب المجربة. "
        ],
        "PotentialChallenges": [
            "• صعوبة التكيف مع التغيير: قد تواجه صعوبة في المواقف التي تتطلب تفكيرًا سريعًا ومرنًا. ",
            "• معايير صارمة: قد تكون جامداً في تطبيق القواعد أو الحكم على الآخرين ممن لا يلبون توقعاتك الدقيقة. ",
            "• أسلوب تواصل متحفظ: قد لا تعبر دائمًا عن مشاعرك بشكل صريح. "
        ],
        "CareersThatSuitYou": [
            "مدقق حسابات: لأنك تتميز بالدقة والاهتمام بالتفاصيل والالتزام بالقواعد. ",
            "مراقب جودة: لأنك تحب النظام والتأكد من اتباع المعايير والإجراءات الدقيقة. ",
            "مدير مشروع صغير: لكونك منظماً وتعمل بجدية على تنفيذ الخطط وفق جدول زمني محدد. "
        ],
        "TipsForMaintainingRelationships": [
            "كن مرنًا مع التغيير: قد تجد صعوبة في التكيف مع التغيير المفاجئ، لذا حاول أن تكون أكثر مرونة وتقبلاً للتغيير عند الحاجة. ",
            "حافظ على توازن جيد بين العمل والحياة الشخصية: قد تركز بشدة على العمل، لذا من المهم تخصيص وقت للراحة والتواصل الاجتماعي. ",
            "اعمل على تحسين مهارات التواصل العاطفي: التعبير عن مشاعرك بوضوح يمكن أن يساعدك في بناء علاقات أقوى وأكثر تواصلًا مع الآخرين. "
        ]
    },
    {
        "id": 2,
        "name": "ISFJ",
        "show": "المدافع",
        "description": "أنت شخص مراعي، لطيف، دافئ، مسؤول، عملي، دقيق. مقدم رعاية مخلص تستمتع بمساعدة الآخرين، ودود ومتحفظ. تركز على الخدمة والعمل، وتحرص على الوفاء بالتزاماتك وواجباتك. أنت وفي وراعٍ وتولي اهتمامًا كبيرًا للعناية بالآخرين. تميل إلى تجنب المواجهة وتقدر البيئة المنظمة والمنسجمة.",
        "powerP": [
            "• عطوف وداعم: تضع رفاهية الآخرين في الأولوية وتبرع في بناء علاقات متناغمة. ",
            "• مسؤول وموثوق: غالبًا ما تلبي التزاماتك بدقة. ",
            "• ملاحظ: تلاحظ التفاصيل الصغيرة المتعلقة باحتياجات وتفضيلات الآخرين. "
        ],
        "PotentialChallenges": [
            "• صعوبة قول 'لا': قد تبالغ في تقديم المساعدة للآخرين على حساب حدودك أو احتياجاتك الشخصية. ",
            "• الحساسية للنقد: قد تأخذ الملاحظات على محمل شخصي مما يؤدي إلى التوتر أو الشك الذاتي. ",
            "• مقاومة الأساليب الجديدة: تفضل الإجراءات التقليدية، مما قد يحد من الابتكار. "
        ],
        "CareersThatSuitYou": [
            "مساعد إداري: لأنك تهتم بتوفير الدعم وتنظيم المهام اليومية بدقة. ",
            "مساعد رعاية صحية: لكونك رحيماً وتهتم برفاهية الآخرين في بيئة داعمة. ",
            "عامل مكتبي: بسبب قدرتك على إدارة الأعمال الروتينية بطريقة منظمة ومستقرة. "
        ],
        "TipsForMaintainingRelationships": [
            "ضع حدودًا صحية: أنت دائمًا مستعد لمساعدة الآخرين، ولكن تذكر أن تأخذ وقتًا لنفسك وأن تقول 'لا' عند الحاجة. ",
            "اعترف بحاجتك إلى الدعم: لا تتردد في طلب المساعدة من الآخرين؛ العلاقات المتوازنة تكون قائمة على الدعم المتبادل. ",
            "كن مرنًا في التكيف مع التغييرات: قد يكون لديك صعوبة في التغيير، ولكن تعلم التكيف مع المواقف الجديدة يمكن أن يعزز نموك الشخصي. "
        ]
    },
    {
        "id": 3,
        "name": "INFJ",
        "show": "المحامي",
        "description": "أنت شخص مثالي، منظم، ثاقب الرؤية، جدير بالثقة، رحيم، لطيف، تسعى للتناغم والتعاون، وتستمتع بالتحفيز الفكري. تميل إلى الجدية والمنطق والاجتهاد، إلى جانب التعاطف والضمير الحي والتحفظ. تقدّر العلاقات العميقة والصادقة، حسّاس لاحتياجات الآخرين، لكنك بحاجة أيضًا إلى وقت ومساحة خاصة لإعادة شحن طاقتك.",
        "powerP": [
            "• متعاطف وبصير: بارع في فهم مشاعر ودوافع الآخرين. ",
            "• مثالي وملتزم بالأهداف: تجمع بين الرؤية الواضحة والعزيمة على تحقيق تأثير ذي معنى. ",
            "• تسعى إلى العلاقات العميقة: تقدّر الأصالة في العلاقات مما يعزز الثقة والولاء. "
        ],
        "PotentialChallenges": [
            "• عرضة للإرهاق: قد تؤدي معاييرك العالية والاستماع التعاطفي إلى التعب العاطفي. ",
            "• التردد في الانفتاح: قد تحتفظ بمشاكلك الشخصية داخل نفسك، مما يعقّد التواصل الحميم. ",
            "• الميل للكمالية: لديك ميل لتحليل الأمور بشكل مفرط أو الانتظار حتى تكون الظروف 'مثالية'. "
        ],
        "CareersThatSuitYou": [
            "كاتب محتوى: لعمق تفكيرك وقدرتك على التعبير عن الأفكار والقيم. ",
            "مترجم: لأنك تتمتع بحس عميق تجاه اللغة والتواصل بين الثقافات. ",
            "باحث: لما لديك من قدرة على التحليل والتعمق في الموضوعات الهادفة. "
        ],
        "TipsForMaintainingRelationships": [
            "كن أكثر واقعية: قد تميل إلى التفكير في الكمال، لكن فكر أن لا شيء مثالي وأن الحياة مليئة بالتحديات. ",
            "لا تضع توقعات عالية جدًا: قد تشعر بالإحباط إذا لم تلبَّ توقعاتك المثالية، لذا حاول أن تكون أكثر مرونة في تقدير النتائج. ",
            "تعلم أن تطلب المساعدة: أنت تميل إلى العناية بالآخرين ولكن من المهم أيضًا أن تطلب الدعم عند الحاجة. "
        ]
    },
    {
        "id": 4,
        "name": "INTJ",
        "show": "المهندس",
        "description": "أنت شخص مبتكر، مستقل، استراتيجي، منطقي، متحفظ، ثاقب الرؤية، مدفوع بأفكارك الأصلية لتحقيق التحسينات. تمتاز بأنك تحليلي، مستقل، وتميل إلى التخطيط بعيد المدى. تبحث عن الكفاءة وتهتم بتحسين الأنظمة والأفكار. غالبًا ما تكون لديك رؤية واضحة وتعمل بإصرار على تحقيقها.",
        "powerP": [
            "• صاحب رؤية استراتيجية: تبرع في وضع الخطط وتحقيق الأهداف بعيدة المدى. ",
            "• مستقل ومنطقي: تعتمد على التفكير العقلاني في اتخاذ القرارات. ",
            "• مبدع في حل المشكلات: تحب تطوير حلول جديدة وغير تقليدية. "
        ],
        "PotentialChallenges": [
            "• صعوبة التعامل مع العواطف: قد تتجاهل الجانب العاطفي للآخرين. ",
            "• توقعات عالية: تميل إلى وضع معايير صعبة لنفسك ولغيرك. ",
            "• ميل إلى العزلة: تفضل العمل الفردي وقد تجد صعوبة في التعاون الجماعي المستمر. "
        ],
        "CareersThatSuitYou": [
            "مستشار إداري: نظراً لاستراتيجيتك وقدرتك على التخطيط طويل المدى وحل المشكلات. ",
            "محلل بيانات: لكونك منطقياً وتحب العمل مع الأنظمة والمعلومات المنظمة. ",
            "مطور نظم صغير: بسبب شغفك بالتفكير النقدي وتطوير الحلول المبتكرة. "
        ],
        "TipsForMaintainingRelationships": [
            "كن أكثر انفتاحاً للتعاون: قد تميل إلى العمل بمفردك، لكن التعاون مع الآخرين يمكن أن يعزز من أفكارك ويؤدي إلى حلول أفضل. ",
            "اعمل على تحسين مهارات التواصل العاطفي: مشاركة مشاعرك مع الآخرين يمكن أن يعزز الروابط العاطفية ويجعل التفاعل أكثر سلاسة. ",
            "كن مستعدًا للتكيف مع الظروف: بالرغم من تمسكك بالخطط، إلا أن التكيف مع التغييرات يمكن أن يساعدك على التقدم بشكل أفضل. "
        ]
    },
    {
        "id": 5,
        "name": "ISTP",
        "show": "الحرفي",
        "description": "أنت شخص موجه نحو العمل، منطقي، تحليلي، عفوي، متحفظ، مستقل، تستمتع بالمغامرة، وماهر في فهم الأشياء، عمليّ، وهادئ، وتبرع في استخدام الأدوات. تتعلم من خلال التجربة وتتميز بردود فعلك السريعة في المواقف الطارئة.",
        "powerP": [
            "• بارع في حل المشكلات: تتصرف بسرعة وفعالية عند مواجهة الأزمات. ",
            "• مرن ومغامر: منفتح على التجارب الجديدة. ",
            "• مستقل: تفضل العمل بطريقتك الخاصة. "
        ],
        "PotentialChallenges": [
            "• صعوبة في التخطيط طويل الأمد: تركز على الحاضر أكثر من المستقبل. ",
            "• تحفظ عاطفي: قد تواجه صعوبة في التعبير عن مشاعرك. ",
            "• مقاومة القيود: لا تحب القواعد الصارمة أو الإشراف المستمر. "
        ],
        "CareersThatSuitYou": [
            "فني صيانة: لأنك تتمتع بمهارات يدوية عالية وقدرة على التعامل مع المشكلات العملية بسرعة. ",
            "ميكانيكي: مناسب لكونك عملياً ومحباً للعمل على الأجهزة والأنظمة الميكانيكية. ",
            "فني إلكترونيات: بسبب شغفك بفهم كيفية عمل الأنظمة التقنية والتعامل معها. "
        ],
        "TipsForMaintainingRelationships": [
            "كن أكثر تعبيرًا عن مشاعرك: قد تكون غير مريح في التعبير عن مشاعرك، ولكن أن تتعلم ذلك يمكن أن يقوي علاقاتك الشخصية. ",
            "حافظ على الالتزام بمسؤولياتك: قد تكون مغامرًا وتحب الحرية، ولكن التمسك بالالتزامات اليومية يمكن أن يعزز من ثقة الآخرين بك. ",
            "لا تتسرع في اتخاذ القرارات: قد تميل إلى اتخاذ قرارات سريعة بناءً على الحدث، لذا حاول التفكير بشكل أكثر تمهلاً قبل اتخاذ قراراتك. "
        ]
    },
    {
        "id": 6,
        "name": "ISFP",
        "show": "المغامر",
        "description": "أنت شخص لطيف، حساس، داعم، مساعد، مرن، واقعي، تسعى لخلق بيئة شخصية جميلة وعملية، هادئ، ومراعٍ، وتقدر الجمال والتجربة. غالبًا ما تعبرعن نفسك من خلال الفن أو الإبداع، وتحب عيش اللحظة.",
        "powerP": [
            "• حسّاس ومتعاطف: تهتم بمشاعر الآخرين. ",
            "• مرن وعفوي: تتأقلم بسهولة مع التغيرات. ",
            "• مبدع: لديك ذوق فني وابتكاري في التعبير. "
        ],
        "PotentialChallenges": [
            "• ميل لتجنب الصراع: قد تكبت مشاعرك لتفادي المواجهة. ",
            "• تشتت الانتباه: قد تواجه صعوبة في الالتزام الطويل بالمشاريع. ",
            "• احتياج كبير للخصوصية: يصعب فهمك أو الاقتراب منك بسهولة. "
        ],
        "CareersThatSuitYou": [
            "رسام/فنان تشكيلي: لأنك تميل للتعبير الإبداعي وتستمتع بالجمال والألوان. ",
            "مصور فوتوغرافي: لكونك حساساً وجيداً في التقاط اللحظات الخاصة والتفاصيل البصرية. ",
            "مصمم أزياء: بسبب ذوقك الفني وقدرتك على الإبداع والتعبير عن الذات من خلال التصميم. "
        ],
        "TipsForMaintainingRelationships": [
            "كن أكثر تنظيمًا: قد تجد صعوبة في اتباع الأنظمة، ولكن التنظيم يساعدك على التقدم بشكل أكثر فاعلية في الحياة اليومية. ",
            "تعلم أن تكون أكثر صبرًا: قد تميل إلى الانتقال بسرعة من فكرة إلى أخرى، لذا حاول أن تكون أكثر صبرًا في التفاعل مع الآخرين. ",
            "حاول تحديد أولوياتك: قد تجد صعوبة في التركيز على الأهداف طويلة المدى، لذا تحديد الأولويات يمكن أن يساعد في تحقيق التوازن. "
        ]
    },
    {
        "id": 7,
        "name": "INFP",
        "show": "الوسيط",
        "description": "أنت شخص حساس، مبدع، مثالي، مدرك، مثالي، وذو قيم قوية، عطوف، ومخلص، تقدّر الانسجام الداخلي والنمو الشخصي، وتركز على الأحلام والاحتمالات. تسعى للعيش بتوافق مع مبادئك، وتهتم كثيرًا بمساعدة الآخرين وتحقيق التغيير الإيجابي.",
        "powerP": [
            "• مخلص وعميق التفكير: تهتم ببناء علاقات صادقة وذات مغزى. ",
            "• خيال واسع: تميل إلى الإبداع والتفكير خارج الصندوق. ",
            "• محفز داخليًا: لا تحتاج لدافع خارجي لتحقيق أهدافك. "
        ],
        "PotentialChallenges": [
            "• الحساسية الزائدة: قد تتأثر بسهولة بالنقد أو الفشل. ",
            "• صعوبة في اتخاذ القرار: تفكر كثيرًا في الخيارات وقد تتردد. ",
            "• الميل للمثالية: توقعاتك قد تكون غير واقعية أحيانًا. "
        ],
        "CareersThatSuitYou": [
            "كاتب/شاعر: لأنك تمتلك خيالاً واسعاً وقدرة على التعبير العاطفي بشكل مبدع. ",
            "مستشار نفسي مبتدئ: لاهتمامك العميق بمساعدة الآخرين وفهم مشاعرهم. ",
            "مترجم أدبي: بسبب حبك للغة وقدرتك على نقل المعاني الدقيقة والراقية بين الثقافات. "
        ],
        "TipsForMaintainingRelationships": [
            "كن أكثر واقعية: قد تميل إلى السعي وراء المثالية، ولكن من المهم أن تكون أكثر قبولًا للواقع وألا تؤجل القرارات بسبب توقعاتك العالية. ",
            "تقبل النقد: قد تجد النقد محبطًا، لكن من المفيد أن تتقبل الملاحظات لتحسين نفسك وعلاقاتك. ",
            "حافظ على التوازن بين المساعدة الذاتية ومساعدة الآخرين: قد تركز على الآخرين كثيرًا، لكن تذكر أن اعتناءك بنفسك يساعد في أن تكون أكثر فعالية في تقديم الدعم للآخرين. "
        ]
    },
    {
        "id": 8,
        "name": "INTP",
        "show": "المفكر",
        "description": "أنت شخص فكري، منطقي، دقيق، متحفظ، مرن، خيالي، تستمتع بالتأمل وحل المشكلات بإبداع. فضولي، مبتكر، وتحب التحليل المنطقي، وتبحث دائمًا عن الفهم العميق للأفكار والنظريات. تستمتع باستكشاف الإمكانيات ولست ملتزماً دائمًا بالتنفيذ.",
        "powerP": [
            "• تفكير تحليلي عميق: بارع في حل المشكلات المعقدة. ",
            "• مستقل فكريًا: تفضل التفكير الذاتي وتكوين آراء خاصة. ",
            "• مبدع فكريًا: لديك نظرة غير تقليدية للأمور. "
        ],
        "PotentialChallenges": [
            "• ضعف في التواصل العاطفي: قد تظهر كأنك غير مهتم بمشاعر الآخرين. ",
            "• التشتت: تبدأ العديد من الأفكار لكنك لا تنهيها. ",
            "• مقاومة الروتين: لا تحب الأنظمة أو القيود الصارمة. "
        ],
        "CareersThatSuitYou": [
            "باحث: بسبب تحليلك العميق ورغبتك الدائمة في استكشاف الأفكار والنظريات. ",
            "كاتب تقني: لأنك تمتلك القدرة على تبسيط المفاهيم المعقدة وتقديمها بوضوح. ",
            "مبرمج مبتدئ: لكونك منطقياً وتستمتع بحل المشكلات من خلال البرمجة. "
        ],
        "TipsForMaintainingRelationships": [
            "كن أكثر مرونة مع المشاعر: قد تميل إلى التركيز على الفكر والعقل، ولكن تعلم التعامل مع المشاعر وتقديرها يمكن أن يعزز علاقاتك. ",
            "حاول أن تكون أكثر اجتماعية: قد تفضل الوحدة، ولكن من المفيد بناء علاقات اجتماعية قوية يمكن أن تكون مصدر دعم عاطفي. ",
            "كن أكثر استماعًا: الاستماع الفعال يساعدك في فهم الآخرين بشكل أفضل وتطوير مهارات التواصل الخاصة بك. "
        ]
    },
    {
        "id": 9,
        "name": "ESTP",
        "show": "المنفذ",
        "description": "أنت شخص اجتماعي، واقعي، موجه نحو العمل، فضولي، متعدد المهارات، عفوي، خبير في حل المشكلات العملية والتفاوض. نشيط، مباشر، تحب الحركة والتجربة، وتتصرف بثقة في المواقف الاجتماعية. تفضل العمل العملي على التنظير.",
        "powerP": [
            "• جريء وواثق: تبرع في اتخاذ قرارات سريعة. ",
            "• موجه نحو النتائج: تركز على تحقيق الأهداف بشكل مباشر. ",
            "• مرن في التفاعل: تتأقلم مع المتغيرات بسهولة. "
        ],
        "PotentialChallenges": [
            "• اندفاعي: قد تتخذ قرارات متسرعة دون التفكير في العواقب. ",
            "• صعوبة في الالتزام: تمل بسرعة من الروتين. ",
            "• تجاهل التفاصيل: تفضل الصورة العامة على التفاصيل الدقيقة. "
        ],
        "CareersThatSuitYou": [
            "مندوب مبيعات: لقدرتك على التعامل مع الناس والتفاوض بسرعة وثقة. ",
            "مستشار تسويق مبتدئ: لأنك ديناميكي وتستمتع بالتحدي والعمل الميداني. ",
            "منظم فعاليات صغير: لكونك تحب العمل في بيئات متغيرة وشيقة وتتفاعل مع الآخرين بسهولة. "
        ],
        "TipsForMaintainingRelationships": [
            "كن أكثر تخطيطًا: قد تميل إلى الاندفاع واتخاذ قرارات سريعة، لذا حاول أن تكون أكثر تأنيًا وتخطيطًا في بعض الأحيان. ",
            "طور مهارات التواصل العاطفي: أنت موجه للأفعال، لكن مشاركة مشاعرك يساعد في بناء علاقات أكثر عمقًا. ",
            "اعمل على التوازن بين العمل والراحة: أنت مفعم بالطاقة، ولكن تأكد من أنك تجد وقتًا للراحة والتواصل العاطفي مع الآخرين. "
        ]
    },
    {
        "id": 10,
        "name": "ESFP",
        "show": "المؤدي",
        "description": "أنت شخص مرح، مُتحمس، ودود، عفوي، لبق، مرن، وتتمتع بحس عملي قوي، وتستمتع بمساعدة الناس بطرق ملموسة. أنت اجتماعي، وممتع، تحب أن تكون مركز الاهتمام وتستمتع بجعل الآخرين سعداء. تعيش اللحظة وتستمتع بالحياة.",
        "powerP": [
            "• محبوب ومتحمس: تجلب الطاقة الإيجابية لمن حولك. ",
            "• عملي: تتعلم من خلال التجربة والتفاعل المباشر. ",
            "• دافئ وعاطفي: تهتم بإسعاد الآخرين. "
        ],
        "PotentialChallenges": [
            "• تركيز على الحاضر فقط: قد تهمل التفكير في المستقبل. ",
            "• تجنب الجدية: لا تميل إلى التعامل مع الأمور الصعبة أو الثقيلة. ",
            "• سطحي أحيانًا: قد تفتقر إلى العمق في العلاقات أو الأفكار. "
        ],
        "CareersThatSuitYou": [
            "مقدم برامج أو مضيف فعاليات: لأنك اجتماعي وتتمتع بجذب الانتباه وإضفاء جو من المرح. ",
            "مصور فوتوغرافي مبتدئ: لكونك مبدعاً وتمتلك حساً فنياً يساعدك على التقاط اللحظات الجميلة. ",
            "فنان في العروض الحية: بسبب قدرتك على التفاعل مع الجمهور وإيصال الطاقة الإيجابية. "
        ],
        "TipsForMaintainingRelationships": [
            "كن أكثر تنظيمًا: قد تميل إلى العيش في اللحظة، لكن تطوير مهارات التنظيم والتخطيط سيساعدك في تحقيق أهدافك. ",
            "حافظ على توازن بين الاستمتاع باللحظة والاهتمام بالمسؤوليات: كن مستعدًا لإعطاء الأولوية لبعض المهام اليومية لتحقيق أهداف طويلة المدى. ",
            "كن مستعدًا للاستماع للآخرين: الانتباه للآخرين وتحقيق توازن بين الاستمتاع والتركيز على مشاكلهم يعزز من جودة العلاقات. "
        ]
    },
    {
        "id": 11,
        "name": "ENFP",
        "show": "المناضل",
        "description": "أنت شخص مُتحمس، مبدع، عفوي، متفائل، داعم، ومرح، تُقدّر الإلهام، وتستمتع ببدء مشاريع جديدة، وترى الإمكانات في الآخرين. ملهم، ومتحمس، تحب التواصل مع الآخرين على مستوى عميق، وتؤمن بالإمكانات الكامنة في كل شيء.",
        "powerP": [
            "• ملهم ومتحمس: تنقل الحماس والطاقة للآخرين. ",
            "• خيال واسع: بارع في الإبداع والابتكار. ",
            "• مُراعي ومتفهم: تسعى لفهم الآخرين بصدق. "
        ],
        "PotentialChallenges": [
            "• تشتت الاهتمام: قد تبدأ مشاريع متعددة دون إنهاء. ",
            "• حساس للنقد: تتأثر سريعًا بالتعليقات السلبية. ",
            "• كره الروتين: تفضل الحرية على الانضباط الصارم. "
        ],
        "CareersThatSuitYou": [
            "مدير مشاريع صغيرة: لقدرتك على الإلهام وتنظيم الفرق بطريقة مرنة ومبتكرة. ",
            "مستشار تطوير شخصي: لأنك تتمتع بحس عاطفي قوي وتميل لمساعدة الآخرين على تحقيق إمكاناتهم. ",
            "مخطط فعاليات: لكونك مبدعاً وتستمتع بتنسيق الأنشطة الاجتماعية والاحتفالات. "
        ],
        "TipsForMaintainingRelationships": [
            "كن أكثر تنظيمًا: قد تميل إلى التفاؤل، ولكن وضع خطة عملية وتحقيق أهداف ملموسة سيساعدك في الاستمرار في التقدم. ",
            "تقبل الواقع: بينما تحب التفكير في الإمكانيات، تأكد من التعامل مع التحديات الواقعية لتحقيق نتائج ملموسة. ",
            "كن أكثر صبرًا مع التفاصيل: قد تجد صعوبة في التركيز على التفاصيل الصغيرة، لذا حاول الاهتمام بالأمور اليومية بشكل أكبر. "
        ]
    },
    {
        "id": 12,
        "name": "ENTP",
        "show": "المحاور",
        "description": "أنت شخص مخترع، مُتحمس، استراتيجي، مغامر، فضولي، متعدد المهارات، تستمتع بالأفكار الجديدة والتحديات، وتقدّر الإلهام. تحب الجدل وتبادل الأفكار والتحدي الذهني. أنت مبتكر، سريع البديهة، وتحب التغيير والتجربة.",
        "powerP": [
            "• مبدع فكريًا: تحب اكتشاف حلول جديدة وغير تقليدية. ",
            "• واثق وجذاب: بارع في التواصل والإقناع. ",
            "• متنوع الاهتمامات: تحب استكشاف مجالات جديدة. "
        ],
        "PotentialChallenges": [
            "• جدليّ: قد تدخل في نقاشات لا داعي لها. ",
            "• صعوبة في التنفيذ: تحب البداية أكثر من الإكمال. ",
            "• تتجاوز الحدود: قد تختبر صبر الآخرين أو الأعراف الاجتماعية. "
        ],
        "CareersThatSuitYou": [
            "مستشار إداري مبتدئ: لأنك تحب تحليل الأفكار وطرح حلول مبتكرة للتحديات. ",
            "كاتب مقالات: لقدرتك على مناقشة الأفكار بطريقة جذابة ومثيرة للتفكير. ",
            "خالق أفكار: لكونك بارعاً في خلق بيئة نقاشية تحفّز الإبداع. "
        ],
        "TipsForMaintainingRelationships": [
            "كن أكثر اهتمامًا بالآخرين: قد تكون متمحورًا حول الأفكار والنقاشات، ولكن تذكر أن الاستماع بعمق للآخرين يعزز من فهمك لهم. ",
            "تجنب الجدل المفرط: في بعض الأحيان، قد تكون المناقشات مع الآخرين بحاجة إلى التحول نحو التعاون بدلاً من الجدال المستمر. ",
            "كن مستعدًا للتكيف مع المواقف: المرونة في التكيف مع الظروف والمواقف يمكن أن تؤدي إلى أفضل النتائج بدلاً من التمسك دائمًا بحلول مبدئية. "
        ]
    },
    {
        "id": 13,
        "name": "ESTJ",
        "show": "المدير",
        "description": " أنت شخص كفوء، اجتماعي، تحليلي، منهجي، موثوق، واقعي، تحب إدارة الأمور وإنجاز المهام بطريقة منظمة. أنت منظم، عمليّ، وتحب اتخاذ القرار، وتؤمن بالنظام وتحرص على تنفيذ الخطط وتحقيق الأهداف بكفاءة. ",
        "powerP": [
            "• قائد بطبعك : تتحمل المسؤولية وتقود الآخرين بوضوح. ",
            "• حاسم ومنظم: تنجز المهام بفعالية. ",
            "• ملتزم بالقواعد: تحب النظام والانضباط. "
        ],
        "PotentialChallenges": [
            "• التسلط: قد تفرض آراءك على الآخرين. ",
            "• مقاومة التغيير: تفضل الطرق المجربة فقط. ",
            "• قلة التعاطف: قد تبدو قاسياً أو غير مرن أحيانًا. "
        ],
        "CareersThatSuitYou": [
            "منسق مكتبي: نظراً لتنظيمك العالي وقدرتك على إدارة الأعمال الإدارية بكفاءة. ",
            "مدير فرعي صغير: لأنك تتمتع بروح القيادة والقدرة على اتخاذ القرارات الحاسمة. ",
            "مشرف إنتاج: لكونك ملتزماً بالأنظمة وتحب ضمان سير العمل وفق الإجراءات المحددة. "
        ],
        "TipsForMaintainingRelationships": [
            "كن أكثر تقبلًا للمرونة: قد تفضل اتباع القواعد والأنظمة، ولكن تعلم المرونة يساعدك في التعامل مع التغيير والظروف المتغيرة. ",
            "طور مهارات التعاطف: قد تركز على الكفاءة، لذا فإن الانفتاح على مشاعر الآخرين والاعتراف بها يعزز التعاون في الفرق. ",
            "استثمر في تطوير الآخرين: كرم الآخرين بتوجيههم وإعطائهم الفرص للنمو، مما يعزز بيئة عمل إيجابية. "
        ]
    },
    {
        "id": 14,
        "name": "ESFJ",
        "show": "القنصل",
        "description": "أنت شخص ودود، اجتماعي، موثوق، ضميري، منظم، عملي، تسعى لتكون مفيدًا وترضي الآخرين، وتستمتع بالنشاط والإنتاجية. أنت مُراعي، ومخلص، وتهتم كثيرًا بإرضاء الآخرين وتحافظ على الانسجام في علاقاتك.",
        "powerP": [
            "• مُراعي للآخرين: تهتم كثيرًا باحتياجات المجتمع من حولك. ",
            "• منظم ومسؤول: تنجز مهامك بدقة والتزام. ",
            "• دافئ ومخلص: تقيم علاقات شخصية قوية. "
        ],
        "PotentialChallenges": [
            "• حساسية مفرطة: تتأثر سريعًا بالنقد. ",
            "• اعتماد على القبول الاجتماعي: قد تتصرف بناءً على رأي الآخرين. ",
            "• مقاومة للأفكار الجديدة: تفضل الأمور المألوفة والمجربة. "
        ],
        "CareersThatSuitYou": [
            "مساعد تدريس: لقدرتك على التعامل بلطف وتنظيم بيئة تعليمية داعمة. ",
            "موظف استقبال: لأنك ودود وتتمتع بقدرة طبيعية على التواصل مع الآخرين. ",
            "مساعد رعاية اجتماعية: لكونك مهتماً بخدمة المجتمع ورعاية احتياجات الآخرين. "
        ],
        "TipsForMaintainingRelationships": [
            "كن أكثر استماعًا: قد تميل إلى تقديم المساعدة للآخرين، ولكن تأكد من أنك تستمع لاحتياجاتهم بعمق. ",
            "حافظ على توازن بين احتياجاتك واحتياجات الآخرين: لا تضع دائمًا احتياجات الآخرين فوق احتياجاتك الشخصية. حافظ على التوازن في العلاقات. ",
            "تعلم أن تكون أكثر مرونة: قد تفضل التقليدية، لذا حاول أن تكون أكثر مرونة في التعامل مع التغييرات والمواقف الجديدة. "
        ]
    },
    {
        "id": 15,
        "name": "ENFJ",
        "show": "المعلم",
        "description": "أنت شخص عطوف، مُتحمس، مثالي، منظم، دبلوماسي، مسؤول، تتواصل بمهارة، وتُقدّر التواصل مع الناس. أنت ملهم، قيادي بالفطرة، وتسعى لرفع الآخرين من حولك. تركز على التعاون والعمل الجماعي وتحقيق النمو الشخصي والاجتماعي.",
        "powerP": [
            "• قائد محفز: تدفع الآخرين لتحقيق الأفضل في أنفسهم. ",
            "• متفهم وعطوف: تقرأ مشاعر الآخرين جيدًا. ",
            "• ملتزم وملهم: تقود بالقيم والمبادئ. "
        ],
        "PotentialChallenges": [
            "• نسيان الذات: تضع احتياجات الآخرين قبل نفسك. ",
            "• صعوبة في قول 'لا': تميل لإرضاء الجميع حتى على حساب راحتك. ",
            "• الكمال: تريد أن يكون كل شيء مثاليًا. "
        ],
        "CareersThatSuitYou": [
            "مدرس أو مدرب: لقدرتك على إلهام الآخرين وتوجيههم لتحقيق الأفضل. ",
            "مستشار توجيهي: لأنك تمتلك حساً عاطفياً قوياً يساعدك على فهم احتياجات الآخرين. ",
            "منسق برامج اجتماعية: لكونك اجتماعياً وتعمل على تعزيز الروابط بين الأفراد في المجتمع. "
        ],
        "TipsForMaintainingRelationships": [
            "كن أكثر اهتمامًا لنفسك: أنت دائمًا تدعم الآخرين، ولكن تذكر أن تهتم بنفسك أيضًا حتى تكون في أفضل حال للمساعدة. ",
            "تقبل النقاشات الصادقة: قد تميل إلى تجنب المواجهات، ولكن تعلم تقبل النقد والتحديات يساعد في تحسين علاقاتك الشخصية. ",
            "كن مستعدًا للتكيف مع اختلافات الآخرين: المرونة في التفكير وفي الأساليب يساعد في فهم الأشخاص المختلفين وبناء علاقات أفضل. "
        ]
    },
    {
        "id": 16,
        "name": "ENTJ",
        "show": "القائد",
        "description": "أنت شخص استراتيجي، منطقي، كفوء، اجتماعي، طموح، مستقل، ومنظم فعال للناس ومخطط بعيد المدى. أنت حاسم، طموح، تحب التحديات والقيادة.",
        "powerP": [
            "• قائد بالفطرة: تضع رؤية واضحة وتقود نحو تحقيقها. ",
            "• مفكر استراتيجي: تخطط بذكاء لتحقيق الأهداف. ",
            "• ملتزم بالكفاءة: تحب تحقيق النجاح وتحسين الأداء. "
        ],
        "PotentialChallenges": [
            "• تسلط أو تحكم: قد تتجاهل مشاعر الآخرين. ",
            "• صعوبة في إظهار الضعف: تفضل إخفاء نقاط ضعفك. ",
            "• نفاد الصبر: لا تتحمل البطء أو الأخطاء بسهولة. "
        ],
        "CareersThatSuitYou": [
            "منسق مشاريع: لقدرتك على التخطيط والتنفيذ بفعالية، وتحقيق النتائج المرجوة. ",
            "مدير فريق صغير: لأنك تتمتع بروح القيادة والتنظيم والتوجيه الواضح للآخرين. ",
            "مستشار إداري مبتدئ: لكونك استراتيجياً بطبعك وتسعى لتحسين الأداء وإيجاد الحلول المبتكرة. "
        ],
        "TipsForMaintainingRelationships": [
            "كن أكثر مرونة في قراراتك: قد تميل إلى اتخاذ القرارات بسرعة، لكن من المفيد أن تكون أكثر انفتاحًا لآراء الآخرين وتفكيرهم. ",
            "تقبل الإخفاقات والتعلم منها: قد تكون موجهًا نحو النجاح دائمًا، لذا من المهم أن تتعلم من الإخفاقات وتعتبرها فرصة للنمو. ",
            "استثمر في تطوير فرقك: استثمار الوقت والجهد في تطوير الآخرين يسهم في بناء بيئة عمل قوية وداعمة. "
        ]
    }
]
